// Задайте массив, заполненный случайными положительными трехзначными числами. 
// Напишите программу, которая покажет количество четных чисел в массиве.

// [345, 897, 568, 234] -> 2


Console.WriteLine("Hello, World!");
