// Пользователь вводит с клавиатуры М чисел.
// Посчитайте сколко чисел больше нуля ввел пользователь.

// 0, 7, 8, -2, -2 -> 2
// -1, -7, 567, 89, 223 -> 3


Console.WriteLine("Hello, World!");
