// Задайте массив из вещественных чисел.
// Найдите разницу между max и min элементами массива.

// [3.5, 7.1, 22.9, 2.3, 78.5] -> 76.2


Console.WriteLine("Hello, World!");
